
1. open this file with GNU Emacs 23 or higher
2. To generate a boxplot, import CSV file into the table by
   executing the sh-block (using: C-c C-c) and
3. execute the R command (using: C-c C-c)

*NOTE*: generating boxplots in this file are *optional* because the
 generation of boxplots has been moved to "generate_boxplots.sh" and
 "generate_boxplots.R"!


* Folders

** Get data

#+NAME: list_of_all_folders_without_paths-lengths
#+BEGIN_SRC sh :exports both 
sort -n folders_without_path_-_lengths.csv
#+END_SRC

#+RESULTS: list_of_all_folders_without_paths-lengths
|  2 |
|  2 |
|  2 |
|  2 |
|  2 |
|  2 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 14 |
| 14 |
| 14 |
| 14 |
| 14 |
| 14 |
| 14 |
| 14 |
| 14 |
| 14 |
| 14 |
| 14 |
| 15 |
| 15 |
| 16 |
| 17 |
| 17 |
| 17 |
| 18 |
| 18 |
| 19 |
| 19 |
| 20 |
| 20 |
| 20 |
| 20 |
| 21 |
| 22 |
| 23 |

#+NAME: unique-folders-per-TP
#+BEGIN_SRC sh :exports both
sort -n folders_number_of_unique_per_TP.csv
#+END_SRC

#+RESULTS: unique-folders-per-TP
|  6 |
|  7 |
|  8 |
|  9 |
|  9 |
| 10 |
| 10 |
| 11 |
| 11 |
| 11 |
| 11 |
| 12 |
| 13 |
| 13 |
| 13 |
| 16 |
| 19 |
| 31 |


** Average folder length

#+NAME: all_folders_-_average_length
#+BEGIN_SRC sh
awk '{ total += $1; count++ } END { print total/count }' \
    < folders_without_path_-_lengths.csv
#+END_SRC

#+RESULTS: all_folders_-_average_length
: 9.14932


** Boxplot

#+NAME: boxplot-data
#+BEGIN_SRC R :var data=list_of_all_folders_without_paths-lengths :exports code :results none
pdf('OPT_folder_length_boxplot.pdf')
boxplot(data, 
    names=c("folder length FE1"), 
    xlab="Formal Experiment 1", 
    ylab="number of characters in folders", 
    pars = list(boxwex = 0.3, staplewex = 0.5, 
    boxfill="lightblue"))
#+END_SRC

#+RESULTS: boxplot-data

*** result boxplot

The result boxplot is written to:

[[file:OPT_folder_length_boxplot.pdf]]


* Tags

** Get data

#+NAME: all_tags_-_lengths
#+BEGIN_SRC sh :exports both
sort -n tags_concated_-_raw_tags_single_unique_-_lengths.csv
#+END_SRC

#+RESULTS: all_tags_-_lengths
|  1 |
|  2 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 14 |
| 14 |
| 14 |
| 14 |
| 14 |
| 14 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 16 |
| 16 |
| 16 |
| 17 |
| 17 |
| 17 |
| 17 |
| 17 |
| 17 |
| 17 |
| 17 |
| 19 |
| 19 |
| 19 |
| 20 |
| 20 |
| 20 |
| 20 |


#+NAME: unique-tags-per-TP
#+BEGIN_SRC sh :exports both
sort -n tags_number_of_unique_per_TP.csv
#+END_SRC

#+RESULTS: unique-tags-per-TP
|  16 |
|  18 |
|  21 |
|  32 |
|  37 |
|  40 |
|  48 |
|  49 |
|  53 |
|  54 |
|  55 |
|  57 |
|  59 |
|  59 |
|  62 |
|  69 |
|  87 |
| 105 |


** Average tag length

#+NAME: all_tags_-_average_length
#+BEGIN_SRC sh
awk '{ total += $1; count++ } END { print total/count }' \
    < tags_concated_-_raw_tags_single_unique_-_lengths.csv
#+END_SRC

#+RESULTS: all_tags_-_average_length
: 7.58632


** Boxplot

#+NAME: boxplot-data
#+BEGIN_SRC R :var data=all_tags_-_lengths :exports code :results none
pdf('OPT_OPT_tag_length_boxplot.pdf')
boxplot(data, 
    names=c("tag length FE1"), 
    xlab="Formal Experiment 1", 
    ylab="number of characters in tags", 
    pars = list(boxwex = 0.3, staplewex = 0.5, 
    boxfill="lightblue"))
#+END_SRC

#+RESULTS: boxplot-data

*** result boxplot

The result boxplot is written to:

[[file:OPT_tag_length_boxplot.pdf]]

* combined tag and folder name length boxplot

#+NAME: boxplot-folder-tag-lengths
#+BEGIN_SRC R :var tags=all_tags_-_lengths :var folders=list_of_all_folders_without_paths-lengths :exports code :results none
pdf('OPT_folder_and_tag_length_boxplot.pdf')
boxplot(list(folders$V1, tags$V1), 
    names=c("folder length", "tag length"), 
    xlab="Formal Experiment 1", 
    ylab="number of characters", 
    pars = list(boxwex = 0.3, staplewex = 0.5, 
    boxfill="lightblue"))
#+END_SRC

#+RESULTS: boxplot-folder-tag-lengths

** result boxplot

The result boxplot is written to:

[[file:OPT_folder_and_tag_length_boxplot.pdf]]


* combined unique tag and folder names boxplot

#+NAME: boxplot-folder-tag-unique-numbers
#+BEGIN_SRC R :var tags=unique-tags-per-TP :var folders=unique-folders-per-TP :exports code :results none
pdf('OPT_folder_and_tag_uniques_boxplot.pdf')
boxplot(list(folders$V1, tags$V1), 
    names=c("folders", "tags"), 
    xlab="Formal Experiment 1", 
    ylab="unique occurrences per TP", 
    pars = list(boxwex = 0.3, staplewex = 0.5, 
    boxfill="lightblue"))
#+END_SRC

#+RESULTS: boxplot-folder-tag-unique-numbers

** result boxplot

The result boxplot is written to:

[[file:OPT_folder_and_tag_uniques_boxplot.pdf]]




* MISC


